; domain
(define (domain garden)

(:requirements :strips)

    (:predicates 
        (PLANT ?p)(VASE ?v)(CRATE ?c)(LOCATION ?s)(HAND ?h)
        (in-vase ?p ?v)(in-crate ?p ?c)
        (at-vase ?v ?s)(at-crate ?c ?s)
        (reachable ?s1 ?s2);from store to A,B or from A,B to C,D
        (empty ?v);empty vase
        (free ?h);free hand
        (grab ?v);grab 
        (empty-spot ?s);shows empty spot
    )
    
    (:action put_plant 
        :parameters(?p ?v ?c ?h ?s)
        :precondition(and (PLANT ?p)(VASE ?v)(LOCATION ?s);choose plant vase and store location
                          (at-crate ?c ?s);crate is in the store
                          (at-vase ?v ?s);vase is in the store
                          (in-crate ?p ?c);crate is full of plant
                          (free ?h);robot hand is free
                      )
        :effect(and (in-vase ?p ?v);plant is in the vase
                    (grab ?v);vase is on the hand
                    (not (free ?h));hand is not free 
                    )
    )
    
    (:action move_vase_AB;move the vases from store to A or B
        :parameters(?h ?s1 ?s2 ?v ?c)
        :precondition(and (LOCATION ?s1)(LOCATION ?s2)(VASE ?v);choose locations as store and A or B
                        (grab ?v);which vase is holded
                        (at-crate ?c ?s1);where is the crate
                        (empty-spot ?s2);is this spot empty
                        (reachable ?s1 ?s2);from store to A or B
                    )
        :effect(and (at-vase ?v ?s2);vase is at the spot
                    (free ?h);hand is free
                    (not (grab ?v));vase not holded
                    (not (empty-spot ?s2));spot is not empty
                    )
    )
    
    
    (:action move_vase_CD;move the vases from store to C or D through A or B
        :parameters(?h ?s1 ?s2 ?s3 ?v1 ?v2)
        :precondition(and (LOCATION ?s1)(LOCATION ?s2)(LOCATION ?s3);s1 = store, s2 = A or B, s3 = C or D
                        (grab ?v1);vase is holded
                        (at-vase ?v2 ?s2);A or B
                        (reachable ?s1 ?s2);from store to A or B
                        (reachable ?s2 ?s3);from A or B to C or D
                        (empty-spot ?s3);C or D is empty
                    )
        :effect(and (at-vase ?v1 ?s3);vase is at the spot
                    (free ?h);hand is free
                    (not (grab ?v1));vase is holded
                    (not (empty-spot ?s3));spot is not free
        )
    )
    
    
   
    
    
    
    
    
    
     
    
    
)

; problem
(define (problem garden-problem)

(:domain garden)

    (:objects 
        p1 p2 p3 p4 ;plants
        v1 v2 v3 v4 ;vases
        crate ;crate
        spotA spotB spotC spotD ;fields
        store ;store
        gripper ;hand
    )
    
    (:init
        ;plants
        (PLANT p1)(PLANT p2)(PLANT p3)(PLANT p4)
        ;vases
        (VASE v1) (VASE v2) (VASE v3) (VASE v4)
        ;crate
        (CRATE crate)
        ;locations A,B,C,D and store
        (LOCATION spotA)(LOCATION spotB)(LOCATION spotC)(LOCATION spotD)(LOCATION store)
        ;robot hand
        (HAND gripper)
        ;which plants are in the crate
        (in-crate p1 crate)(in-crate p2 crate)(in-crate p3 crate)(in-crate p4 crate)
        ;where is crate
        (at-crate crate store)
        ;where are the vases
        (at-vase v1 store)(at-vase v2 store)
        (at-vase v3 store)(at-vase v4 store)
        ;reachable locations
        (reachable store spotA)(reachable store spotB)
        (reachable spotA spotC)(reachable spotB spotD)
        ;initial vase conditions
        (empty v1)(empty v2)(empty v3)(empty v4)
        ;hand
        (free gripper)
        ;empty spots at the beginning
        (empty-spot spotA)(empty-spot spotB)(empty-spot spotC)(empty-spot spotD)
    )
    
    (:goal 
        (and
        ;plants are in the vases
        (in-vase p1 v1)(in-vase p2 v2)(in-vase p3 v3)(in-vase p4 v4)
        ;vases are at the spots
        (at-vase v1 spotA)(at-vase v2 spotB)(at-vase v3 spotC)(at-vase v4 spotD)
        )
    )
    
)

; plan
1. (put_plant p1 v1 crate gripper store)
   deleted: (free gripper)
   added: (in-vase p1 v1) (grab v1)
   goals met: 1 of 8
2. (move_vase_ab gripper store spota v1 crate)
   deleted: (grab v1) (empty-spot spota)
   added: (at-vase v1 spota) (free gripper)
   goals met: 2 of 8
3. (put_plant p2 v2 crate gripper store)
   deleted: (free gripper)
   added: (in-vase p2 v2) (grab v2)
   goals met: 3 of 8
4. (move_vase_ab gripper store spotb v2 crate)
   deleted: (grab v2) (empty-spot spotb)
   added: (at-vase v2 spotb) (free gripper)
   goals met: 4 of 8
5. (put_plant p3 v3 crate gripper store)
   deleted: (free gripper)
   added: (in-vase p3 v3) (grab v3)
   goals met: 5 of 8
6. (move_vase_cd gripper store spota spotc v3 v1)
   deleted: (grab v3) (empty-spot spotc)
   added: (at-vase v3 spotc) (free gripper)
   goals met: 6 of 8
7. (put_plant p4 v4 crate gripper store)
   deleted: (free gripper)
   added: (in-vase p4 v4) (grab v4)
   goals met: 7 of 8
8. (move_vase_cd gripper store spotb spotd v4 v2)
   deleted: (grab v4) (empty-spot spotd)
   added: (at-vase v4 spotd) (free gripper)
   goals met: 8 of 8
